:PROPERTIES:
:ID:       38d44122-73b2-4ad3-97c4-6c45523a7fa8
:mtime:    20230521163231
:ctime:    20230521163228
:END:
#+title: JavaScript Reference

Properties and Methods of all JavaScript Objects, with Examples:

** charAt()

Returns the character at a specified index (position) in a string.

syntax:
string.charAt(index)

parameters:
index optional this index (position) of the character default = 0.

return value
string if out range return empty string

#+begin_src js
let text = "hello world";

// Get the first character in a string:
let firstLetter = text.charAt(0);
console.log(firstLetter);

// Get the second character in a string:
let secondLetter = text.charAt(1);
console.log(secondLetter);

// Get the last character in a string:
let lastLetter = text.charAt(text.length-1);
console.log(lastLetter);
#+end_src

#+RESULTS:
: h
: e
: 11
: 10
: d
: undefined

** charCodeAt()

Returns the Unicode of the character at a specified index (position) in a string.

charCodeAt() is UTF-16
charCodeAt() return a number between 0 and 65535.

parameters index optional. A number. The index (position) of a character.
Default value equals 0.

return value a number. NaN if the index is invaild.

#+begin_src js
let text = "hello world";

// Get the first character in a string:
let firstCode = text.charCodeAt(0);
console.log(firstCode);

// Get the second character in a string:
let secondCode = text.charCodeAt(1);
console.log(secondCode);

// Get the last character in a string:
let lastLetter = text.charCodeAt(text.length-1);
console.log(lastLetter);
#+end_src

#+RESULTS:
: 104
: 101
: 100
: undefined

** concat()

Returns two or more joined strings.
does not change the existing strings.
returns a new string.

syntax
string.concat(string1, string2, ..., stringN)

parameters stringN required the strings to be joined

return value a string; a new string constaining the combined strings.

#+begin_src js
let text1 = "sea";
let text2 = "food";
// Join two strings
let result = text1.concat(text2);
console.log(result);

// Join two strings with space inbetween
result = text1.concat(" ", text2);
console.log(result);

result = text1.concat(" ", text2, " ", "testing");
console.log(result);

#+end_src

#+RESULTS:
: seafood
: sea food
: sea food testing
: undefined

